socialNetwork/jaeger_traces/limit_socnetapp_compose-post-service/traces_0.5.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 4.489ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.983ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.607ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.693ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.440ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.537ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.667ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.466ms, rate sampling interval: 10ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.45ms  718.23us   6.22ms   82.86%
    Req/Sec    25.65     50.92   200.00     77.28%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.34ms
 75.000%    4.75ms
 90.000%    5.20ms
 99.000%    6.22ms
 99.900%    7.18ms
 99.990%   30.74ms
 99.999%   30.74ms
100.000%   30.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.221     0.000000            1         1.00
       3.805     0.100000          394         1.11
       3.967     0.200000          782         1.25
       4.089     0.300000         1173         1.43
       4.215     0.400000         1565         1.67
       4.339     0.500000         1963         2.00
       4.403     0.550000         2160         2.22
       4.479     0.600000         2351         2.50
       4.563     0.650000         2547         2.86
       4.647     0.700000         2733         3.33
       4.751     0.750000         2929         4.00
       4.807     0.775000         3028         4.44
       4.875     0.800000         3129         5.00
       4.935     0.825000         3225         5.71
       5.003     0.850000         3323         6.67
       5.079     0.875000         3417         8.00
       5.131     0.887500         3465         8.89
       5.195     0.900000         3517        10.00
       5.263     0.912500         3566        11.43
       5.347     0.925000         3613        13.33
       5.447     0.937500         3660        16.00
       5.495     0.943750         3685        17.78
       5.551     0.950000         3709        20.00
       5.627     0.956250         3734        22.86
       5.707     0.962500         3758        26.67
       5.779     0.968750         3782        32.00
       5.827     0.971875         3795        35.56
       5.867     0.975000         3807        40.00
       5.931     0.978125         3819        45.71
       6.011     0.981250         3834        53.33
       6.079     0.984375         3843        64.00
       6.119     0.985938         3851        71.11
       6.151     0.987500         3856        80.00
       6.183     0.989062         3862        91.43
       6.243     0.990625         3868       106.67
       6.315     0.992188         3874       128.00
       6.323     0.992969         3877       142.22
       6.423     0.993750         3880       160.00
       6.487     0.994531         3883       182.86
       6.623     0.995313         3886       213.33
       6.671     0.996094         3889       256.00
       6.759     0.996484         3891       284.44
       6.855     0.996875         3892       320.00
       6.999     0.997266         3894       365.71
       7.047     0.997656         3895       426.67
       7.115     0.998047         3898       512.00
       7.115     0.998242         3898       568.89
       7.115     0.998437         3898       640.00
       7.119     0.998633         3899       731.43
       7.175     0.998828         3900       853.33
       7.591     0.999023         3901      1024.00
       7.591     0.999121         3901      1137.78
       7.591     0.999219         3901      1280.00
       7.887     0.999316         3902      1462.86
       7.887     0.999414         3902      1706.67
       8.583     0.999512         3903      2048.00
       8.583     0.999561         3903      2275.56
       8.583     0.999609         3903      2560.00
       8.583     0.999658         3903      2925.71
       8.583     0.999707         3903      3413.33
      30.735     0.999756         3904      4096.00
      30.735     1.000000         3904          inf
#[Mean    =        4.448, StdDeviation   =        0.718]
#[Max     =       30.720, Total count    =         3904]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5859 requests in 30.07s, 1.20MB read
  Socket errors: connect 0, read 0, write 0, timeout 9491
Requests/sec:    194.84  
Transfer/sec:     40.91KB