socialNetwork/jaeger_traces/limit_socnetapp_compose-post-service/traces_0.8.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 4.722ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.699ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.525ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.784ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.738ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.875ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.709ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.906ms, rate sampling interval: 12ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.51ms  700.49us   6.41ms   82.76%
    Req/Sec    25.50     48.81   200.00     75.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.40ms
 75.000%    4.78ms
 90.000%    5.25ms
 99.000%    6.41ms
 99.900%    8.91ms
 99.990%   18.43ms
 99.999%   18.43ms
100.000%   18.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.223     0.000000            1         1.00
       3.887     0.100000          392         1.11
       4.035     0.200000          781         1.25
       4.163     0.300000         1178         1.43
       4.275     0.400000         1568         1.67
       4.399     0.500000         1954         2.00
       4.455     0.550000         2156         2.22
       4.519     0.600000         2344         2.50
       4.599     0.650000         2542         2.86
       4.687     0.700000         2733         3.33
       4.779     0.750000         2925         4.00
       4.827     0.775000         3022         4.44
       4.887     0.800000         3115         5.00
       4.959     0.825000         3214         5.71
       5.031     0.850000         3311         6.67
       5.135     0.875000         3407         8.00
       5.195     0.887500         3459         8.89
       5.247     0.900000         3505        10.00
       5.307     0.912500         3555        11.43
       5.375     0.925000         3603        13.33
       5.471     0.937500         3650        16.00
       5.527     0.943750         3675        17.78
       5.623     0.950000         3699        20.00
       5.695     0.956250         3723        22.86
       5.783     0.962500         3749        26.67
       5.863     0.968750         3772        32.00
       5.923     0.971875         3785        35.56
       5.963     0.975000         3796        40.00
       6.051     0.978125         3808        45.71
       6.151     0.981250         3823        53.33
       6.195     0.984375         3833        64.00
       6.239     0.985938         3840        71.11
       6.319     0.987500         3845        80.00
       6.379     0.989062         3851        91.43
       6.423     0.990625         3857       106.67
       6.551     0.992188         3863       128.00
       6.591     0.992969         3866       142.22
       6.611     0.993750         3870       160.00
       6.619     0.994531         3872       182.86
       6.675     0.995313         3876       213.33
       6.799     0.996094         3878       256.00
       7.111     0.996484         3880       284.44
       7.295     0.996875         3881       320.00
       7.355     0.997266         3883       365.71
       7.479     0.997656         3884       426.67
       7.699     0.998047         3886       512.00
       7.851     0.998242         3887       568.89
       7.851     0.998437         3887       640.00
       7.943     0.998633         3888       731.43
       8.911     0.998828         3889       853.33
      13.447     0.999023         3890      1024.00
      13.447     0.999121         3890      1137.78
      13.447     0.999219         3890      1280.00
      17.199     0.999316         3891      1462.86
      17.199     0.999414         3891      1706.67
      17.983     0.999512         3892      2048.00
      17.983     0.999561         3892      2275.56
      17.983     0.999609         3892      2560.00
      17.983     0.999658         3892      2925.71
      17.983     0.999707         3892      3413.33
      18.431     0.999756         3893      4096.00
      18.431     1.000000         3893          inf
#[Mean    =        4.510, StdDeviation   =        0.700]
#[Max     =       18.416, Total count    =         3893]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5824 requests in 30.06s, 1.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 9510
Requests/sec:    193.77  
Transfer/sec:     40.68KB